app/controllers/admins_controller.rb

  def update
    if @admin.update(admin_params)
---
UPDATE "admins" SET "token" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["token", "new_token"], ["updated_at", "2017-07-23 18:19:06.375354"], ["id", 1]]

    def set_admin
      @admin = Admin.first
---
SELECT  "admins".* FROM "admins" ORDER BY "admins"."id" ASC LIMIT ?  [["LIMIT", 1]]